/**************************************************************
1096번
nayeonvita
C
정확한 풀이코드 길이:333 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include <stdio.h>

int main(){
    int n,x,y, a[20][20]={};
    scanf("%lld", &n);
    for(int i = 1; i <=n; i++){
        scanf("%d %d", &x, &y);
        a[x][y]=1;
    }

    for(int i = 1; i <= 19; i++){
        for(int j = 1; j <= 19; j++){
            printf("%d ", a[i][j]);
        }
    printf("\n");
    }
}
