/**************************************************************
1099번
nayeonvita
C
정확한 풀이코드 길이:496 byte(s)
수행 시간:0 ms
메모리 :1120 kb
****************************************************************/


#include <stdio.h>

int main(){
    int a[11][11] = {}, x = 2, y = 2, i, j;

    for(i = 1; i <= 10; i++)
        for(j = 1; j <= 10; j++)
            scanf("%d", &a[i][j]);

    while(a[x][y]!=2){
        a[x][y] = 9;
        if(a[x][y+1] != 1) y += 1;
        else if(a[x+1][y] != 1) x += 1;
        else break;
    }

    a[x][y] = 9;

    for(i = 1; i <= 10; i++){
        for(j = 1; j <= 10; j++){
            printf("%d ", a[i][j]);
        }
    }
    return 0;
}

